{
  "nodes": [
    {
      "op": "null", 
      "name": "input", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform", 
        "src_layout": "NCHW", 
        "dst_layout": "NCHW3c", 
        "hash": "ba3dc2c95d3171fd"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu", 
        "out_layout": "NCHW32c", 
        "data_layout": "NCHW3c", 
        "kernel_layout": "OIHW3i32o", 
        "hash": "020e7a0020adb28c"
      }, 
      "inputs": [
        [
          1, 
          0, 
          0
        ], 
        [
          2, 
          0, 
          0
        ], 
        [
          3, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_max_pool2d", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_max_pool2d", 
        "out_layout": "", 
        "layout": "NCHW32c", 
        "hash": "a4aeb799b63fb85a"
      }, 
      "inputs": [
        [
          4, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_1", 
        "src_layout": "NCHW32c", 
        "dst_layout": "NCHW64c", 
        "hash": "946c598a1da7475b"
      }, 
      "inputs": [
        [
          5, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p2", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p3", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_1", 
        "out_layout": "NCHW32c", 
        "data_layout": "NCHW64c", 
        "kernel_layout": "OIHW64i32o", 
        "hash": "35b19e27a40f9b21"
      }, 
      "inputs": [
        [
          6, 
          0, 
          0
        ], 
        [
          7, 
          0, 
          0
        ], 
        [
          8, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_1_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_1", 
        "src_layout": "NCHW32c", 
        "dst_layout": "NCHW64c", 
        "hash": "946c598a1da7475b"
      }, 
      "inputs": [
        [
          9, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p4", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p5", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu", 
        "out_layout": "NCHW32c", 
        "data_layout": "NCHW64c", 
        "kernel_layout": "OIHW64i32o", 
        "hash": "914010a9784b4773"
      }, 
      "inputs": [
        [
          10, 
          0, 
          0
        ], 
        [
          11, 
          0, 
          0
        ], 
        [
          12, 
          0, 
          0
        ], 
        [
          5, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_1_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_1", 
        "src_layout": "NCHW32c", 
        "dst_layout": "NCHW64c", 
        "hash": "946c598a1da7475b"
      }, 
      "inputs": [
        [
          13, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p6", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p7", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_1_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_1", 
        "out_layout": "NCHW32c", 
        "data_layout": "NCHW64c", 
        "kernel_layout": "OIHW64i32o", 
        "hash": "35b19e27a40f9b21"
      }, 
      "inputs": [
        [
          14, 
          0, 
          0
        ], 
        [
          15, 
          0, 
          0
        ], 
        [
          16, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_1_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_1", 
        "src_layout": "NCHW32c", 
        "dst_layout": "NCHW64c", 
        "hash": "946c598a1da7475b"
      }, 
      "inputs": [
        [
          17, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p8", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p9", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu", 
        "out_layout": "NCHW32c", 
        "data_layout": "NCHW64c", 
        "kernel_layout": "OIHW64i32o", 
        "hash": "914010a9784b4773"
      }, 
      "inputs": [
        [
          18, 
          0, 
          0
        ], 
        [
          19, 
          0, 
          0
        ], 
        [
          20, 
          0, 
          0
        ], 
        [
          13, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p10", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p11", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_2", 
        "out_layout": "NCHW64c", 
        "data_layout": "NCHW32c", 
        "kernel_layout": "OIHW32i64o", 
        "hash": "ee68e74df739599d"
      }, 
      "inputs": [
        [
          21, 
          0, 
          0
        ], 
        [
          22, 
          0, 
          0
        ], 
        [
          23, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_2", 
        "src_layout": "NCHW64c", 
        "dst_layout": "NCHW128c", 
        "hash": "bacab588469a969d"
      }, 
      "inputs": [
        [
          24, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p12", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p13", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_3", 
        "src_layout": "NCHW32c", 
        "dst_layout": "NCHW8c", 
        "hash": "ca4a56ef68429adb"
      }, 
      "inputs": [
        [
          21, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p14", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p15", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add", 
        "out_layout": "NCHW32c", 
        "data_layout": "NCHW8c", 
        "kernel_layout": "OIHW8i32o", 
        "hash": "56bb84ff6798a271"
      }, 
      "inputs": [
        [
          28, 
          0, 
          0
        ], 
        [
          29, 
          0, 
          0
        ], 
        [
          30, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_1_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_1", 
        "out_layout": "NCHW32c", 
        "data_layout": "NCHW128c", 
        "kernel_layout": "OIHW128i32o", 
        "hash": "b19e155dad88f19e"
      }, 
      "inputs": [
        [
          25, 
          0, 
          0
        ], 
        [
          26, 
          0, 
          0
        ], 
        [
          27, 
          0, 
          0
        ], 
        [
          31, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_4", 
        "src_layout": "NCHW32c", 
        "dst_layout": "NCHW128c", 
        "hash": "bfbb5b091e5cb36a"
      }, 
      "inputs": [
        [
          32, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p16", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p17", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_3", 
        "out_layout": "NCHW32c", 
        "data_layout": "NCHW128c", 
        "kernel_layout": "OIHW128i32o", 
        "hash": "19d83a693e8ab3b8"
      }, 
      "inputs": [
        [
          33, 
          0, 
          0
        ], 
        [
          34, 
          0, 
          0
        ], 
        [
          35, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_4_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_4", 
        "src_layout": "NCHW32c", 
        "dst_layout": "NCHW128c", 
        "hash": "bfbb5b091e5cb36a"
      }, 
      "inputs": [
        [
          36, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p18", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p19", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_1_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_1", 
        "out_layout": "NCHW32c", 
        "data_layout": "NCHW128c", 
        "kernel_layout": "OIHW128i32o", 
        "hash": "b19e155dad88f19e"
      }, 
      "inputs": [
        [
          37, 
          0, 
          0
        ], 
        [
          38, 
          0, 
          0
        ], 
        [
          39, 
          0, 
          0
        ], 
        [
          32, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_5", 
        "src_layout": "NCHW32c", 
        "dst_layout": "NCHW8c", 
        "hash": "05018b914be523d7"
      }, 
      "inputs": [
        [
          40, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p20", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p21", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_4", 
        "out_layout": "NCHW32c", 
        "data_layout": "NCHW8c", 
        "kernel_layout": "OIHW8i32o", 
        "hash": "d169eb60136ba7ee"
      }, 
      "inputs": [
        [
          41, 
          0, 
          0
        ], 
        [
          42, 
          0, 
          0
        ], 
        [
          43, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_6", 
        "src_layout": "NCHW32c", 
        "dst_layout": "NCHW128c", 
        "hash": "fbe49be6289146cd"
      }, 
      "inputs": [
        [
          44, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p22", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p23", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_7", 
        "src_layout": "NCHW32c", 
        "dst_layout": "NCHW64c", 
        "hash": "d1951bd28e994d36"
      }, 
      "inputs": [
        [
          40, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p24", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p25", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_1", 
        "out_layout": "NCHW16c", 
        "data_layout": "NCHW64c", 
        "kernel_layout": "OIHW64i16o", 
        "hash": "6f65139ca80b8ed4"
      }, 
      "inputs": [
        [
          48, 
          0, 
          0
        ], 
        [
          49, 
          0, 
          0
        ], 
        [
          50, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_2", 
        "out_layout": "NCHW16c", 
        "data_layout": "NCHW128c", 
        "kernel_layout": "OIHW128i16o", 
        "hash": "5a1b918c22df55a0"
      }, 
      "inputs": [
        [
          45, 
          0, 
          0
        ], 
        [
          46, 
          0, 
          0
        ], 
        [
          47, 
          0, 
          0
        ], 
        [
          51, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_8", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_8", 
        "src_layout": "NCHW16c", 
        "dst_layout": "NCHW128c", 
        "hash": "b80e4e903c8a3f68"
      }, 
      "inputs": [
        [
          52, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p26", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p27", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_5", 
        "out_layout": "NCHW16c", 
        "data_layout": "NCHW128c", 
        "kernel_layout": "OIHW128i16o", 
        "hash": "930fc5cd0d044327"
      }, 
      "inputs": [
        [
          53, 
          0, 
          0
        ], 
        [
          54, 
          0, 
          0
        ], 
        [
          55, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_8_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_8", 
        "src_layout": "NCHW16c", 
        "dst_layout": "NCHW128c", 
        "hash": "b80e4e903c8a3f68"
      }, 
      "inputs": [
        [
          56, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p28", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p29", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_2_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_2", 
        "out_layout": "NCHW16c", 
        "data_layout": "NCHW128c", 
        "kernel_layout": "OIHW128i16o", 
        "hash": "5a1b918c22df55a0"
      }, 
      "inputs": [
        [
          57, 
          0, 
          0
        ], 
        [
          58, 
          0, 
          0
        ], 
        [
          59, 
          0, 
          0
        ], 
        [
          52, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_9", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_9", 
        "src_layout": "NCHW16c", 
        "dst_layout": "NCHW8c", 
        "hash": "cbd2bfb4719cc499"
      }, 
      "inputs": [
        [
          60, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p30", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p31", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_6", 
        "out_layout": "NCHW32c", 
        "data_layout": "NCHW8c", 
        "kernel_layout": "OIHW8i32o", 
        "hash": "87cbf95d0ca930be"
      }, 
      "inputs": [
        [
          61, 
          0, 
          0
        ], 
        [
          62, 
          0, 
          0
        ], 
        [
          63, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_10", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_10", 
        "src_layout": "NCHW32c", 
        "dst_layout": "NCHW512c", 
        "hash": "88d96c514dc40c70"
      }, 
      "inputs": [
        [
          64, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p32", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p33", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_8_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_8", 
        "src_layout": "NCHW16c", 
        "dst_layout": "NCHW128c", 
        "hash": "b80e4e903c8a3f68"
      }, 
      "inputs": [
        [
          60, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p34", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p35", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_2", 
        "out_layout": "NCHW32c", 
        "data_layout": "NCHW128c", 
        "kernel_layout": "OIHW128i32o", 
        "hash": "dbc479f481e48874"
      }, 
      "inputs": [
        [
          68, 
          0, 
          0
        ], 
        [
          69, 
          0, 
          0
        ], 
        [
          70, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_3", 
        "out_layout": "NCHW32c", 
        "data_layout": "NCHW512c", 
        "kernel_layout": "OIHW512i32o", 
        "hash": "d2c510d2167e57ca"
      }, 
      "inputs": [
        [
          65, 
          0, 
          0
        ], 
        [
          66, 
          0, 
          0
        ], 
        [
          67, 
          0, 
          0
        ], 
        [
          71, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_10_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_10", 
        "src_layout": "NCHW32c", 
        "dst_layout": "NCHW512c", 
        "hash": "88d96c514dc40c70"
      }, 
      "inputs": [
        [
          72, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p36", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p37", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_7", 
        "out_layout": "NCHW32c", 
        "data_layout": "NCHW512c", 
        "kernel_layout": "OIHW512i32o", 
        "hash": "770becd1874099ca"
      }, 
      "inputs": [
        [
          73, 
          0, 
          0
        ], 
        [
          74, 
          0, 
          0
        ], 
        [
          75, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_10_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_10", 
        "src_layout": "NCHW32c", 
        "dst_layout": "NCHW512c", 
        "hash": "88d96c514dc40c70"
      }, 
      "inputs": [
        [
          76, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p38", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p39", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_3_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_relu_3", 
        "out_layout": "NCHW32c", 
        "data_layout": "NCHW512c", 
        "kernel_layout": "OIHW512i32o", 
        "hash": "d2c510d2167e57ca"
      }, 
      "inputs": [
        [
          77, 
          0, 
          0
        ], 
        [
          78, 
          0, 
          0
        ], 
        [
          79, 
          0, 
          0
        ], 
        [
          72, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_global_avg_pool2d", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_global_avg_pool2d", 
        "out_layout": "", 
        "layout": "NCHW32c", 
        "hash": "68d8fb2f1d8e7752"
      }, 
      "inputs": [
        [
          80, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_nn_batch_flatten", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_nn_batch_flatten", 
        "src_layout": "NCHW32c", 
        "dst_layout": "NCHW", 
        "hash": "e30b7a39e704a234"
      }, 
      "inputs": [
        [
          81, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p40", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p41", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_dense_pack_add", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_dense_pack_add", 
        "weight_layout": "NC8n", 
        "hash": "2ecf5e8d49b69064"
      }, 
      "inputs": [
        [
          82, 
          0, 
          0
        ], 
        [
          83, 
          0, 
          0
        ], 
        [
          84, 
          0, 
          0
        ]
      ]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    3, 
    7, 
    8, 
    11, 
    12, 
    15, 
    16, 
    19, 
    20, 
    22, 
    23, 
    26, 
    27, 
    29, 
    30, 
    34, 
    35, 
    38, 
    39, 
    42, 
    43, 
    46, 
    47, 
    49, 
    50, 
    54, 
    55, 
    58, 
    59, 
    62, 
    63, 
    66, 
    67, 
    69, 
    70, 
    74, 
    75, 
    78, 
    79, 
    83, 
    84
  ], 
  "heads": [
    [
      85, 
      0, 
      0
    ]
  ], 
  "attrs": {
    "dltype": [
      "list_str", 
      [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"
      ]
    ], 
    "device_index": [
      "list_int", 
      [
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1
      ]
    ], 
    "storage_id": [
      "list_int", 
      [
        0, 
        1, 
        2, 
        3, 
        4, 
        1, 
        4, 
        5, 
        6, 
        7, 
        4, 
        8, 
        9, 
        7, 
        1, 
        10, 
        11, 
        4, 
        1, 
        12, 
        13, 
        4, 
        14, 
        15, 
        1, 
        7, 
        16, 
        17, 
        1, 
        18, 
        19, 
        4, 
        1, 
        7, 
        20, 
        21, 
        4, 
        7, 
        22, 
        23, 
        4, 
        7, 
        24, 
        25, 
        1, 
        7, 
        26, 
        27, 
        1, 
        28, 
        29, 
        4, 
        1, 
        7, 
        30, 
        31, 
        4, 
        7, 
        32, 
        33, 
        4, 
        7, 
        34, 
        35, 
        1, 
        7, 
        36, 
        37, 
        1, 
        38, 
        39, 
        40, 
        1, 
        40, 
        41, 
        42, 
        7, 
        40, 
        43, 
        44, 
        7, 
        45, 
        46, 
        47, 
        48, 
        45
      ]
    ], 
    "shape": [
      "list_shape", 
      [
        [1, 3, 224, 224], 
        [1, 1, 224, 224, 3], 
        [2, 1, 7, 7, 3, 32], 
        [1, 2, 1, 1, 32], 
        [1, 2, 112, 112, 32], 
        [1, 2, 56, 56, 32], 
        [1, 1, 56, 56, 64], 
        [2, 1, 3, 3, 64, 32], 
        [1, 2, 1, 1, 32], 
        [1, 2, 56, 56, 32], 
        [1, 1, 56, 56, 64], 
        [2, 1, 3, 3, 64, 32], 
        [1, 2, 1, 1, 32], 
        [1, 2, 56, 56, 32], 
        [1, 1, 56, 56, 64], 
        [2, 1, 3, 3, 64, 32], 
        [1, 2, 1, 1, 32], 
        [1, 2, 56, 56, 32], 
        [1, 1, 56, 56, 64], 
        [2, 1, 3, 3, 64, 32], 
        [1, 2, 1, 1, 32], 
        [1, 2, 56, 56, 32], 
        [2, 2, 3, 3, 32, 64], 
        [1, 2, 1, 1, 64], 
        [1, 2, 28, 28, 64], 
        [1, 1, 28, 28, 128], 
        [4, 1, 3, 3, 128, 32], 
        [1, 4, 1, 1, 32], 
        [1, 8, 56, 56, 8], 
        [4, 8, 1, 1, 8, 32], 
        [1, 4, 1, 1, 32], 
        [1, 4, 28, 28, 32], 
        [1, 4, 28, 28, 32], 
        [1, 1, 28, 28, 128], 
        [4, 1, 3, 3, 128, 32], 
        [1, 4, 1, 1, 32], 
        [1, 4, 28, 28, 32], 
        [1, 1, 28, 28, 128], 
        [4, 1, 3, 3, 128, 32], 
        [1, 4, 1, 1, 32], 
        [1, 4, 28, 28, 32], 
        [1, 16, 28, 28, 8], 
        [8, 16, 3, 3, 8, 32], 
        [1, 8, 1, 1, 32], 
        [1, 8, 14, 14, 32], 
        [1, 2, 14, 14, 128], 
        [16, 2, 3, 3, 128, 16], 
        [1, 16, 1, 1, 16], 
        [1, 2, 28, 28, 64], 
        [16, 2, 1, 1, 64, 16], 
        [1, 16, 1, 1, 16], 
        [1, 16, 14, 14, 16], 
        [1, 16, 14, 14, 16], 
        [1, 2, 14, 14, 128], 
        [16, 2, 3, 3, 128, 16], 
        [1, 16, 1, 1, 16], 
        [1, 16, 14, 14, 16], 
        [1, 2, 14, 14, 128], 
        [16, 2, 3, 3, 128, 16], 
        [1, 16, 1, 1, 16], 
        [1, 16, 14, 14, 16], 
        [1, 32, 14, 14, 8], 
        [16, 32, 3, 3, 8, 32], 
        [1, 16, 1, 1, 32], 
        [1, 16, 7, 7, 32], 
        [1, 1, 7, 7, 512], 
        [16, 1, 3, 3, 512, 32], 
        [1, 16, 1, 1, 32], 
        [1, 2, 14, 14, 128], 
        [16, 2, 1, 1, 128, 32], 
        [1, 16, 1, 1, 32], 
        [1, 16, 7, 7, 32], 
        [1, 16, 7, 7, 32], 
        [1, 1, 7, 7, 512], 
        [16, 1, 3, 3, 512, 32], 
        [1, 16, 1, 1, 32], 
        [1, 16, 7, 7, 32], 
        [1, 1, 7, 7, 512], 
        [16, 1, 3, 3, 512, 32], 
        [1, 16, 1, 1, 32], 
        [1, 16, 7, 7, 32], 
        [1, 16, 1, 1, 32], 
        [1, 512], 
        [125, 512, 8], 
        [1, 1000], 
        [1, 1000]
      ]
    ]
  }, 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86
  ]
}